# AngularDimensionsDisplayOption Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarBendingDetailType..::..AngularDimensionsDisplayOption Property
RebarBendingDetailType Class See Also
---
Identifies the angular dimensions display options.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public BendingDetailAngularDimensionsDisplayOptions AngularDimensionsDisplayOption { get; set; }
```

Visual Basic
---
```text
Public Property AngularDimensionsDisplayOption As BendingDetailAngularDimensionsDisplayOptions
	Get
	Set
```

Visual C++
---
```text
public:
property BendingDetailAngularDimensionsDisplayOptions AngularDimensionsDisplayOption {
	BendingDetailAngularDimensionsDisplayOptions get ();
	void set (BendingDetailAngularDimensionsDisplayOptions value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace